#     ค่าไฟ = (หน่วยที่ 1–150 × 3.24847) 
#     + (หน่วยที่ 151–400 × 4.2218) 
#     + (หน่วยที่เกิน 400 × 4.4217)
#     + Ft × หน่วยไฟ
#     + ค่าบริการรายเดือน 24.62 บาท
#     + ภาษีมูลค่าเพิ่ม 7% (ค่าไฟ + Ft × หน่วยไฟ + ค่าบริการรายเดือน)
#     + ค่าไฟฟ้าผันแปร (Ft) 46.38 สตางค์/หน่วย (มิ.ย. 66)
     

try:
    k = int(input("กรอกหน่วยไฟฟ้า : "))

    service_charge = 24.64  # ค่าบริการรายเดือน

    if k < 0:
        print("กรุณากรอกตัวเลขที่ถูกต้อง")
    elif k <= 150:
        cost = k * 3.2484
    elif k <= 400:
        cost = (150 * 3.2484) + ((k - 150) * 4.2218)
    else:
        cost = (150 * 3.2484) + (250 * 4.2218) + ((k - 400) * 4.4217)

    # รวมค่าบริการรายเดือน
    total = cost + service_charge

    print("ค่าไฟฟ้ารวมทั้งหมด : ", round(total, 2), "บาท")

except ValueError:
    print("กรุณากรอกเป็นตัวเลขเท่านั้น")

   